{
  "title": "Portfolio of Gabriel",
  "projects": "Projects",
  "about_me": "About me",
  "contact": "Contact",
  "full_stack_developer": "Full Stack Developer",
  "ai_cv_maker": "Resume generator with AI",
  "ai_cv_maker_description": "Add your background, paste the job description, choose your preferred language or tone, and receive a polished CV plus cover letter in under a minute.",
  "tech_stack": "Tech Stack",
  "github_code_link": "Code on github",
  "live_project_link": "Live project",
  "clean_code_course": "Clean code course",
  "in_progress": "In progress",
  "bookinvideo_description": "Summary of the book Clean Code where I present situations in which it is possible to apply the concepts described in the book. I am migrating the platform from WordPress to Angular and Node",
  "elleve_fullstack_developer_title": "Full Stack Developer | Elleve",
  "elleve_tenure": "feb 2025 - nov 2025 (10 months)",
  "elleve_description": "Elleve is an HR Tech and ED Tech company that financially supports employees' tuition fees for courses at partner educational institutions.",
  "responsabilities": "Responsabilities",
  "elleve_responsabilties": [
    "I worked on developing internal systems and financial integrations, creating scalable APIs and React interfaces for products used by thousands of users."
  ],
  "main_tech_stack": "Main tech stack",
  "rb_title": "Front-End Developer | R&B Rastreabilidade Brasil",
  "rb_tenure": "dec 2021 - oct 2023 (1 year and 11 months)",
  "rb_description": "R&B is a startup that offers product traceability systems using RFID (Radio-Frequency Identification) tags.",
  "rb_responsabilties": [
    "I developed a web application for creating label layouts directly in the browser, using canvas. The solution reduced label creation time and significantly improved usability for non-technical users."
  ],
  "houpa_title": "Front-End Developer | Houpa",
  "houpa_tenure": "jan 2021 - may 2021 (5 months)",
  "houpa_description": "Houpa is a B2C and B2B platform for buying and selling in the fashion industry.",
  "houpa_responsabilties": [
    "I developed reusable components in React for the e-commerce project and for the creation of responsive landing pages."
  ]
}
