{
  "title": "Portfolio of Gabriel",
  "hero_name": "Gabriel Barbosa",
  "full_stack_developer": "Full Stack Developer",
  "hero_short_bio": "I build modern web products from idea to production, with focus on business impact, scalability, and clean architecture.",
  "view_projects": "View projects",
  "contact_cta": "Contact",
  "projects": "Projects",
  "about_me": "About",
  "experience": "Experience",
  "tech_stack": "Tech Stack",
  "contact": "Contact",
  "read_more": "Read more",
  "read_less": "Read less",
  "live_project_link": "Demo",
  "github_code_link": "GitHub",
  "ai_cv_maker": "Resume generator with AI",
  "ai_cv_maker_description": "Enter your professional information, paste the job description, and choose your preferred language or tone. The app analyzes the context and automatically generates a tailored resume and cover letter optimized for the opportunity.",
  "clean_code_course": "Online courses platform",
  "bookinvideo_description": "Conceived and developed BookInVideo, a proprietary online learning platform. The first version was built with WordPress to validate the product. I am rebuilding it with Next.js and NestJS focusing on scalability, business rules, and performance.",
  "about_summary": "I am a full stack developer focused on building reliable products that solve real problems. I work close to business and product teams to deliver fast, maintainable, and measurable outcomes.",
  "elleve_fullstack_developer_title": "Full Stack Developer",
  "elleve_tenure": "Feb 2025 - Nov 2025",
  "elleve_responsabilties": [
    "Built internal financial workflows and product APIs used by thousands of users.",
    "Developed React interfaces integrated with complex back-end rules and payment flows.",
    "Improved maintainability by structuring modules and reducing coupling between services."
  ],
  "rb_title": "Front-end Developer ",
  "rb_tenure": "Dec 2021 - Oct 2023",
  "rb_responsabilties": [
    "Built a browser-based label layout editor using canvas for non-technical operators.",
    "Reduced label setup time and improved operational efficiency on shop-floor routines.",
    "Implemented reusable UI components that accelerated feature delivery."
  ],
  "houpa_title": "Front-end Developer",
  "houpa_tenure": "Jan 2021 - May 2021",
  "houpa_responsabilties": [
    "Developed reusable React components for e-commerce and landing pages.",
    "Delivered responsive interfaces with strong focus on conversion and UX.",
    "Collaborated with design and product teams to ship features quickly."
  ],
  "bookinvideo_title": "Founder & Full Stack Developer",
  "bookinvideo_tenure": "Nov 2023 - Dec 2024",
  "bookinvideo_responsibilities": [
    "Development of a proprietary online course platform focused on architectural organization and user experience.",
    "Full-stack development, responsible for data modeling, authentication, lesson progress tracking, and front-end and back-end integration.",
    "Deployment and production environment configuration."
  ],
  "frontend": "Frontend",
  "backend": "Backend",
  "database": "Database",
  "infra_tools": "Infra/Tools",
  "stack_frontend": [
    "Next.js",
    "React",
    "TypeScript",
    "Tailwind CSS",
    "Shadcn/ui",
    "Angular",
    "Material UI"
  ],
  "stack_backend": [
    "Node.js",
    "NestJS",
    "Python",
    "FastAPI",
    "REST APIs"
  ],
  "stack_database": [
    "PostgreSQL",
    "TypeORM",
    "Prisma"
  ],
  "stack_infra_tools": [
    "Docker",
    "GitHub Actions",
    "Vercel",
    "GCP",
    "Jest"
  ],
  "email_label": "Email"
}
