{
  "title": "Portfolio do Gabriel",
  "projects": "Projetos",
  "about_me": "Sobre mim",
  "contact": "Contato",
  "full_stack_developer": "Desenvolvedor Full Stack",
  "ai_cv_maker": "Gerador de currículo com IA",
  "ai_cv_maker_description": "Adicione suas informações profissionais, cole a descrição da vaga, escolha o idioma ou tom de sua preferência e receba um currículo e uma carta de apresentação impecáveis ​em menos de um minuto.",
  "tech_stack": "Tecnologias utilizadas",
  "github_code_link": "Ver código no github",
  "live_project_link": "Ver projeto online",
  "clean_code_course": "Curso de código limpo",
  "in_progress": "Em progresso",
  "bookinvideo_description": "Resumo do livro código limpo onde eu apresento situações onde é possível aplicar os conceitos descritos no livro. A primeira versão da plataforma foi feita em WordPress, estou migrando para Angular e Node.",
  "elleve_fullstack_developer_title": "Desenvolvedor Full Stack | Elleve",
  "elleve_tenure": "fev de 2025 - nov de 2025 (10 meses)",
  "elleve_description": "A Elleve é ​​uma HR Tech e ED Tech que ajuda financeiramente o rendimento de colaboradores em cursos de instituições de ensino parceiras.",
  "responsabilities": "Responsabilidades",
  "elleve_responsabilties": [
    "Atuei no desenvolvimento de sistemas internos e integrações financeiras, criando APIs escaláveis e interfaces em React para produtos utilizados por milhares de usuários."
  ],
  "main_tech_stack": "Principais tecnologias utilizadas",
  "rb_title": "Desenvolvedor Front-End | R&B Rastreabilidade Brasil",
  "rb_tenure": "dez de 2021 - out de 2023 (1 ano e 11 meses)",
  "rb_description": "A R&B é uma startup de que oferece sistemas de rastreabilidade de produtos fazendo uso de etiquetas RFID (Radio-Frequency Identification).",
  "rb_responsabilties": [
    "Desenvolvi uma aplicação web para criação de layouts de etiquetas diretamente no navegador, utilizando canvas. A solução reduziu o tempo de criação de etiquetas e melhorou significativamente a usabilidade para usuários não técnicos."
  ],
  "houpa_title": "Desenvolvedor Front-End | Houpa",
  "houpa_tenure": "jan de 2021 - mai de 2021 (5 meses)",
  "houpa_description": "O Houpa é uma plataforma b2c e b2b de compra e venda no setor de moda.",
  "houpa_responsabilties": [
    "Desenvolvi componentes reutilizáveis em React para o projeto de e-commerce e pela criação de landing pages responsivas."
  ]
}
